grevaillot/svd_tools/headers/STM32H750x/sai2.h
#pragma once 

/* --- SAI2: SAI ---------------------------------------------------- */

/** @defgroup sai2_registers SAI Register
@{*/

/** SAI2_SAI_GCR Global configuration register **/
#define SAI2_SAI_GCR			MMIO32(SAI2_BASE + 0x00)
/** SAI2_SAI_ACR1 Configuration register 1 **/
#define SAI2_SAI_ACR1			MMIO32(SAI2_BASE + 0x04)
/** SAI2_SAI_ACR2 Configuration register 2 **/
#define SAI2_SAI_ACR2			MMIO32(SAI2_BASE + 0x08)
/** SAI2_SAI_AFRCR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI2_SAI_AFRCR			MMIO32(SAI2_BASE + 0x0c)
/** SAI2_SAI_ASLOTR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI2_SAI_ASLOTR			MMIO32(SAI2_BASE + 0x10)
/** SAI2_SAI_AIM Interrupt mask register 2 **/
#define SAI2_SAI_AIM			MMIO32(SAI2_BASE + 0x14)
/** SAI2_SAI_ASR Status register **/
#define SAI2_SAI_ASR			MMIO32(SAI2_BASE + 0x18)
/** SAI2_SAI_ACLRFR Clear flag register **/
#define SAI2_SAI_ACLRFR			MMIO32(SAI2_BASE + 0x1c)
/** SAI2_SAI_ADR Data register **/
#define SAI2_SAI_ADR			MMIO32(SAI2_BASE + 0x20)
/** SAI2_SAI_BCR1 Configuration register 1 **/
#define SAI2_SAI_BCR1			MMIO32(SAI2_BASE + 0x24)
/** SAI2_SAI_BCR2 Configuration register 2 **/
#define SAI2_SAI_BCR2			MMIO32(SAI2_BASE + 0x28)
/** SAI2_SAI_BFRCR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI2_SAI_BFRCR			MMIO32(SAI2_BASE + 0x2c)
/** SAI2_SAI_BSLOTR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI2_SAI_BSLOTR			MMIO32(SAI2_BASE + 0x30)
/** SAI2_SAI_BIM Interrupt mask register 2 **/
#define SAI2_SAI_BIM			MMIO32(SAI2_BASE + 0x34)
/** SAI2_SAI_BSR Status register **/
#define SAI2_SAI_BSR			MMIO32(SAI2_BASE + 0x38)
/** SAI2_SAI_BCLRFR Clear flag register **/
#define SAI2_SAI_BCLRFR			MMIO32(SAI2_BASE + 0x3c)
/** SAI2_SAI_BDR Data register **/
#define SAI2_SAI_BDR			MMIO32(SAI2_BASE + 0x40)
/** SAI2_SAI_PDMCR PDM control register **/
#define SAI2_SAI_PDMCR			MMIO32(SAI2_BASE + 0x44)
/** SAI2_SAI_PDMDLY PDM delay register **/
#define SAI2_SAI_PDMDLY			MMIO32(SAI2_BASE + 0x48)

/**@}*/


/** @defgroup sai2_sai_gcr SAIGCR Global configuration register
@{*/


#define SAI2_SAI_GCR_SYNCOUT_SHIFT		4
#define SAI2_SAI_GCR_SYNCOUT_MASK		0x03
/** @defgroup sai2_sai_gcr_syncout SYNCOUT Synchronization outputs These bits are set and cleared by software.
@{*/
/**@}*/


#define SAI2_SAI_GCR_SYNCIN_SHIFT		0
#define SAI2_SAI_GCR_SYNCIN_MASK		0x03
/** @defgroup sai2_sai_gcr_syncin SYNCIN Synchronization inputs
@{*/
/**@}*/


/**@}*/

/** @defgroup sai2_sai_acr1 SAIACR1 Configuration register 1
@{*/

/** SAI2_SAI_ACR1_OSR Oversampling ratio for master clock **/
#define SAI2_SAI_ACR1_OSR		(1 << 26)

#define SAI2_SAI_ACR1_MCKDIV_SHIFT		20
#define SAI2_SAI_ACR1_MCKDIV_MASK		0x0f
/** @defgroup sai2_sai_acr1_mckdiv MCKDIV Master clock divider. These bits are set and cleared by software. These bits are meaningless when the audio block operates in slave mode. They have to be configured when the audio block is disabled. Others: the master clock frequency is calculated accordingly to the following formula:
@{*/
/**@}*/

/** SAI2_SAI_ACR1_NOMCK No divider **/
#define SAI2_SAI_ACR1_NOMCK		(1 << 19)
/** SAI2_SAI_ACR1_DMAEN DMA enable. This bit is set and cleared by software. Note: Since the audio block defaults to operate as a transmitter after reset, the MODE[1:0] bits must be configured before setting DMAEN to avoid a DMA request in receiver mode. **/
#define SAI2_SAI_ACR1_DMAEN		(1 << 17)
/** SAI2_SAI_ACR1_SAIXEN Audio block enable where x is A or B. This bit is set by software. To switch off the audio block, the application software must program this bit to 0 and poll the bit till it reads back 0, meaning that the block is completely disabled. Before setting this bit to 1, check that it is set to 0, otherwise the enable command will not be taken into account. This bit allows to control the state of SAIx audio block. If it is disabled when an audio frame transfer is ongoing, the ongoing transfer completes and the cell is fully disabled at the end of this audio frame transfer. Note: When SAIx block is configured in master mode, the clock must be present on the input of SAIx before setting SAIXEN bit. **/
#define SAI2_SAI_ACR1_SAIXEN		(1 << 16)
/** SAI2_SAI_ACR1_OUTDRIV Output drive. This bit is set and cleared by software. Note: This bit has to be set before enabling the audio block and after the audio block configuration. **/
#define SAI2_SAI_ACR1_OUTDRIV		(1 << 13)
/** SAI2_SAI_ACR1_MONO Mono mode. This bit is set and cleared by software. It is meaningful only when the number of slots is equal to 2. When the mono mode is selected, slot 0 data are duplicated on slot 1 when the audio block operates as a transmitter. In reception mode, the slot1 is discarded and only the data received from slot 0 are stored. Refer to Section: Mono/stereo mode for more details. **/
#define SAI2_SAI_ACR1_MONO		(1 << 12)

#define SAI2_SAI_ACR1_SYNCEN_SHIFT		10
#define SAI2_SAI_ACR1_SYNCEN_MASK		0x03
/** @defgroup sai2_sai_acr1_syncen SYNCEN Synchronization enable. These bits are set and cleared by software. They must be configured when the audio sub-block is disabled. Note: The audio sub-block should be configured as asynchronous when SPDIF mode is enabled.
@{*/
/**@}*/

/** SAI2_SAI_ACR1_CKSTR Clock strobing edge. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in SPDIF audio protocol. **/
#define SAI2_SAI_ACR1_CKSTR		(1 << 9)
/** SAI2_SAI_ACR1_LSBFIRST Least significant bit first. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in AC97 audio protocol since AC97 data are always transferred with the MSB first. This bit has no meaning in SPDIF audio protocol since in SPDIF data are always transferred with LSB first. **/
#define SAI2_SAI_ACR1_LSBFIRST		(1 << 8)

#define SAI2_SAI_ACR1_DS_SHIFT		5
#define SAI2_SAI_ACR1_DS_MASK		0x07
/** @defgroup sai2_sai_acr1_ds DS Data size. These bits are set and cleared by software. These bits are ignored when the SPDIF protocols are selected (bit PRTCFG[1:0]), because the frame and the data size are fixed in such case. When the companding mode is selected through COMP[1:0] bits, DS[1:0] are ignored since the data size is fixed to 8 bits by the algorithm. These bits must be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI2_SAI_ACR1_PRTCFG_SHIFT		2
#define SAI2_SAI_ACR1_PRTCFG_MASK		0x03
/** @defgroup sai2_sai_acr1_prtcfg PRTCFG Protocol configuration. These bits are set and cleared by software. These bits have to be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI2_SAI_ACR1_MODE_SHIFT		0
#define SAI2_SAI_ACR1_MODE_MASK		0x03
/** @defgroup sai2_sai_acr1_mode MODE SAIx audio block mode immediately
@{*/
/**@}*/


/**@}*/

