grevaillot/svd_tools/headers/STM32H750x/sai2.h
#define SAI2_SAI_BCR1_PRTCFG_SHIFT		2
#define SAI2_SAI_BCR1_PRTCFG_MASK		0x03
/** @defgroup sai2_sai_bcr1_prtcfg PRTCFG Protocol configuration. These bits are set and cleared by software. These bits have to be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI2_SAI_BCR1_MODE_SHIFT		0
#define SAI2_SAI_BCR1_MODE_MASK		0x03
/** @defgroup sai2_sai_bcr1_mode MODE SAIx audio block mode immediately
@{*/
/**@}*/


/**@}*/

/** @defgroup sai2_sai_bcr2 SAIBCR2 Configuration register 2
@{*/


#define SAI2_SAI_BCR2_COMP_SHIFT		14
#define SAI2_SAI_BCR2_COMP_MASK		0x03
/** @defgroup sai2_sai_bcr2_comp COMP Companding mode. These bits are set and cleared by software. The -Law and the A-Law log are a part of the CCITT G.711 recommendation, the type of complement that will be used depends on CPL bit. The data expansion or data compression are determined by the state of bit MODE[0]. The data compression is applied if the audio block is configured as a transmitter. The data expansion is automatically applied when the audio block is configured as a receiver. Refer to Section: Companding mode for more details. Note: Companding mode is applicable only when TDM is selected.
@{*/
/**@}*/

/** SAI2_SAI_BCR2_CPL Complement bit. This bit is set and cleared by software. It defines the type of complement to be used for companding mode Note: This bit has effect only when the companding mode is -Law algorithm or A-Law algorithm. **/
#define SAI2_SAI_BCR2_CPL		(1 << 13)

#define SAI2_SAI_BCR2_MUTECNT_SHIFT		7
#define SAI2_SAI_BCR2_MUTECNT_MASK		0x3f
/** @defgroup sai2_sai_bcr2_mutecnt MUTECNT Mute counter. These bits are set and cleared by software. They are used only in reception mode. The value set in these bits is compared to the number of consecutive mute frames detected in reception. When the number of mute frames is equal to this value, the flag MUTEDET will be set and an interrupt will be generated if bit MUTEDETIE is set. Refer to Section: Mute mode for more details.
@{*/
/**@}*/

/** SAI2_SAI_BCR2_MUTEVAL Mute value. This bit is set and cleared by software.It must be written before enabling the audio block: SAIXEN. This bit is meaningful only when the audio block operates as a transmitter, the number of slots is lower or equal to 2 and the MUTE bit is set. If more slots are declared, the bit value sent during the transmission in mute mode is equal to 0, whatever the value of MUTEVAL. if the number of slot is lower or equal to 2 and MUTEVAL = 1, the MUTE value transmitted for each slot is the one sent during the previous frame. Refer to Section: Mute mode for more details. Note: This bit is meaningless and should not be used for SPDIF audio blocks. **/
#define SAI2_SAI_BCR2_MUTEVAL		(1 << 6)
/** SAI2_SAI_BCR2_MUTE Mute. This bit is set and cleared by software. It is meaningful only when the audio block operates as a transmitter. The MUTE value is linked to value of MUTEVAL if the number of slots is lower or equal to 2, or equal to 0 if it is greater than 2. Refer to Section: Mute mode for more details. Note: This bit is meaningless and should not be used for SPDIF audio blocks. **/
#define SAI2_SAI_BCR2_MUTE		(1 << 5)
/** SAI2_SAI_BCR2_TRIS Tristate management on data line. This bit is set and cleared by software. It is meaningful only if the audio block is configured as a transmitter. This bit is not used when the audio block is configured in SPDIF mode. It should be configured when SAI is disabled. Refer to Section: Output data line management on an inactive slot for more details. **/
#define SAI2_SAI_BCR2_TRIS		(1 << 4)
/** SAI2_SAI_BCR2_FFLUSH FIFO flush. This bit is set by software. It is always read as 0. This bit should be configured when the SAI is disabled. **/
#define SAI2_SAI_BCR2_FFLUSH		(1 << 3)

#define SAI2_SAI_BCR2_FTH_SHIFT		0
#define SAI2_SAI_BCR2_FTH_MASK		0x07
/** @defgroup sai2_sai_bcr2_fth FTH FIFO threshold. This bit is set and cleared by software.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai2_sai_bfrcr SAIBFRCR This register has no meaning in AC97 and SPDIF audio protocol
@{*/

/** SAI2_SAI_BFRCR_FSOFF Frame synchronization offset. This bit is set and cleared by software. It is meaningless and is not used in AC97 or SPDIF audio block configuration. This bit must be configured when the audio block is disabled. **/
#define SAI2_SAI_BFRCR_FSOFF		(1 << 18)
/** SAI2_SAI_BFRCR_FSPOL Frame synchronization polarity. This bit is set and cleared by software. It is used to configure the level of the start of frame on the FS signal. It is meaningless and is not used in AC97 or SPDIF audio block configuration. This bit must be configured when the audio block is disabled. **/
#define SAI2_SAI_BFRCR_FSPOL		(1 << 17)
/** SAI2_SAI_BFRCR_FSDEF Frame synchronization definition. This bit is set and cleared by software. When the bit is set, the number of slots defined in the SAI_xSLOTR register has to be even. It means that half of this number of slots will be dedicated to the left channel and the other slots for the right channel (e.g: this bit has to be set for I2S or MSB/LSB-justified protocols...). This bit is meaningless and is not used in AC97 or SPDIF audio block configuration. It must be configured when the audio block is disabled. **/
#define SAI2_SAI_BFRCR_FSDEF		(1 << 16)

#define SAI2_SAI_BFRCR_FSALL_SHIFT		8
#define SAI2_SAI_BFRCR_FSALL_MASK		0x7f
/** @defgroup sai2_sai_bfrcr_fsall FSALL Frame synchronization active level length. These bits are set and cleared by software. They specify the length in number of bit clock (SCK) + 1 (FSALL[6:0] + 1) of the active level of the FS signal in the audio frame These bits are meaningless and are not used in AC97 or SPDIF audio block configuration. They must be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI2_SAI_BFRCR_FRL_SHIFT		0
#define SAI2_SAI_BFRCR_FRL_MASK		0xff
/** @defgroup sai2_sai_bfrcr_frl FRL Frame length. These bits are set and cleared by software. They define the audio frame length expressed in number of SCK clock cycles: the number of bits in the frame is equal to FRL[7:0] + 1. The minimum number of bits to transfer in an audio frame must be equal to 8, otherwise the audio block will behaves in an unexpected way. This is the case when the data size is 8 bits and only one slot 0 is defined in NBSLOT[4:0] of SAI_xSLOTR register (NBSLOT[3:0] = 0000). In master mode, if the master clock (available on MCLK_x pin) is used, the frame length should be aligned with a number equal to a power of 2, ranging from 8 to 256. When the master clock is not used (NODIV = 1), it is recommended to program the frame length to an value ranging from 8 to 256. These bits are meaningless and are not used in AC97 or SPDIF audio block configuration.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai2_sai_bslotr SAIBSLOTR This register has no meaning in AC97 and SPDIF audio protocol
@{*/


